function aws=DES()
m=input('請輸入類型(加密/解密)\n','s');
if m=="加密"
    m=1;
    text=input('請輸入明文(至少八個字元):\n','s');
    key=input('請輸入16位密碼:\n','s');
else
    m=2;
    text=input('請輸入需解密的字串:\n','s');
    key=input('請輸入16位密碼:\n','s');
end
%--------------------------------IP變換表-------------------------------%
IP=[58 50 42 34 26 18 10 2;
    60 52 44 36 28 20 12 4;
    62 54 46 38 30 22 14 6;
    64 56 48 40 32 24 16 8;
    57 49 41 33 25 17 9 1;
    59 51 43 35 27 19 11 3;
    61 53 45 37 29 21 13 5;
    63 55 47 39 31 23 15 7;];
IP_1=[40 8 48 16 56 24 64 32;
    39 7 47 15 55 23 63 31;
    38 6 46 14 54 22 62 30;
    37 5 45 13 53 21 61 29;
    36 4 44 12 52 20 60 28;
    35 3 43 11 51 19 59 27;
    34 2 42 10 50 18 58 26;
    33 1 41 9 49 17 57 25];
%--------------------------------P盒變換表-------------------------------%
P=[16,7,20,21,29,12,28,17,1,15,23,26,5,18,31,10,2,8,24,14,32,27,3,9,19,13,30,6,22,11,4,25];
PC1=[57,49,41,33,25,17,9,1,58,50,42,34,26,18,10,2,59,51,43,35,27,19,11,3,60,52,44,36,63,55,47,39,31,23,15,7,62,54,46,38,30,22,14,6,61,53,45,37,29,21,13,5,28,20,12,4];
PC2=[14,17,11,24,1,5,3,28,15,6,21,10,23,19,12,4,26,8,16,7,27,20,13,2,41,52,31,37,47,55,30,40,51,45,33,48,44,49,39,56,34,53,46,42,50,36,29,32];
%--------------------------------E函數表格和S盒-------------------------------%
E=[32, 1, 2, 3, 4, 5;
    4, 5, 6, 7, 8, 9;
    8, 9,10,11,12,13;
    12,13,14,15,16,17;
    16,17,18,19,20,21;
    20,21,22,23,24,25;
    24,25,26,27,28,29;
    28,29,30,31,32,1];
S1=[14, 4, 13, 1, 2, 15, 11, 8, 3, 10, 6, 12, 5, 9, 0, 7;
    0, 15, 7, 4, 14, 2, 13, 1, 10, 6, 12, 11, 9, 5, 3, 8;
    4, 1, 14, 8, 13, 6, 2, 11, 15, 12, 9, 7, 3, 10, 5, 0;
    15, 12, 8, 2, 4, 9, 1, 7, 5, 11, 3, 14, 10, 0, 6, 13];
S2=[15, 1, 8, 14, 6, 11, 3, 4, 9, 7, 2, 13, 12, 0, 5, 10;
    3, 13, 4, 7, 15, 2, 8, 14, 12, 0, 1, 10, 6, 9, 11, 5;
    0, 14, 7, 11, 10, 4, 13, 1, 5, 8, 12, 6, 9, 3, 2, 15;
    13, 8, 10, 1, 3, 15, 4, 2, 11, 6, 7, 12, 0, 5, 14, 9];
S3=[10, 0, 9, 14, 6, 3, 15, 5, 1, 13, 12, 7, 11, 4, 2, 8;
    13, 7, 0, 9, 3, 4, 6, 10, 2, 8, 5, 14, 12, 11, 15, 1;
    13, 6, 4, 9, 8, 15, 3, 0, 11, 1, 2, 12, 5, 10, 14, 7;
    1, 10, 13, 0, 6, 9, 8, 7, 4, 15, 14, 3, 11, 5, 2, 12];
S4=[7, 13, 14, 3, 0, 6, 9, 10, 1, 2, 8, 5, 11, 12, 4, 15;
    13, 8, 11, 5, 6, 15, 0, 3, 4, 7, 2, 12, 1, 10, 14, 9;
    10, 6, 9, 0, 12, 11, 7, 13, 15, 1, 3, 14, 5, 2, 8, 4;
    3, 15, 0, 6, 10, 1, 13, 8, 9, 4, 5, 11, 12, 7, 2, 14];
S5=[2, 12, 4, 1, 7, 10, 11, 6, 8, 5, 3, 15, 13, 0, 14, 9;
    14, 11, 2, 12, 4, 7, 13, 1, 5, 0, 15, 10, 3, 9, 8, 6;
    4, 2, 1, 11, 10, 13, 7, 8, 15, 9, 12, 5, 6, 3, 0, 14;
    11, 8, 12, 7, 1, 14, 2, 13, 6, 15, 0, 9, 10, 4, 5, 3];
S6=[12, 1, 10, 15, 9, 2, 6, 8, 0, 13, 3, 4, 14, 7, 5, 11;
    10, 15, 4, 2, 7, 12, 9, 5, 6, 1, 13, 14, 0, 11, 3, 8;
    9, 14, 15, 5, 2, 8, 12, 3, 7, 0, 4, 10, 1, 13, 11, 6;
    4, 3, 2, 12, 9, 5, 15, 10, 11, 14, 1, 7, 6, 0, 8, 13];
S7=[4, 11, 2, 14, 15, 0, 8, 13, 3, 12, 9, 7, 5, 10, 6, 1;
    13, 0, 11, 7, 4, 9, 1, 10, 14, 3, 5, 12, 2, 15, 8, 6;
    1, 4, 11, 13, 12, 3, 7, 14, 10, 15, 6, 8, 0, 5, 9, 2;
    6, 11, 13, 8, 1, 4, 10, 7, 9, 5, 0, 15, 14, 2, 3, 12];
S8=[13, 2, 8, 4, 6, 15, 11, 1, 10, 9, 3, 14, 5, 0, 12, 7;
    1, 15, 13, 8, 10, 3, 7, 4, 12, 5, 6, 11, 0, 14, 9, 2;
    7, 11, 4, 1, 9, 12, 14, 2, 0, 6, 10, 13, 15, 3, 5, 8;
    2, 1, 14, 7, 4, 10, 8, 13, 15, 12, 9, 0, 3, 5, 6, 11];
%--------------------------------明文text處理-------------------------------%

if m==1
    DB=abs(text);                        %將明文text換成ascii碼
    count=length(DB);                    %計算DB矩陣大小
    DB2=[];
    i=1;
    while count~=0
        DB2=[DB2,two(DB(i),1)];
        i=i+1;
        count=count-1;
    end
    text=DB2;
else
    count=length(text);
    DB3=[];
    i=1;
    while count~=0
        DB3=[DB3,two(text(i),2)];
        i=i+1;
        count=count-1;
    end
    text=DB3;
end

%--------------------------------密鑰key處理-------------------------------%
KB=key;
KB2=[];
i=1;
count=length(KB);
while count~=0                     %將16進制密鑰轉換成2進制
    KB2=[KB2,two(key(i),2)];
    i=i+1;
    count=count-1;
end
key=KB2;
%--------------------------------子密鑰處理-------------------------------%
Ki=zeros(16,48);
key_PC1=key(PC1);
C0=key_PC1(1:28);
D0=key_PC1(29:56);
for i=1:16
    if i==1||i==2||i==9||i==16
        C0=[C0(2:end),C0(1)];
        D0=[D0(2:end),D0(1)];
    else
        C0=[C0(3:end),C0(1:2)];
        D0=[D0(3:end),D0(1:2)];
    end
    K_CD=[C0,D0];
    Ki(i,:)=K_CD(PC2);
end
%--------------------------------明文加密成密文(16次循環)-------------------------------%
test=floor(length(text)/64);
ex=text(1:64);
answer=[];
j=0;
flag=0;
while test>=0
    if length(text)==64
        ex=text(1:64);
        test=-1;
    else
        if  test==1&&mod(length(text),64)==0
            test=-1;
            ex=text(1+64*j:64+64*j);
        elseif (test==0)
            ex=text(1+64*j:end);
            str=mod(length(ex),64);               %計算除64後的餘數
            if str~=0                             %判斷是否64個2進制(64位元)的倍數;因為每8個bits構成一個二進制數
                flag=1;
                for i=1:64-str
                    ex=[ex,str2num('0')];
                end
            end
        else
            ex=text(1+64*j:64+64*j);
            j=j+1;
        end
        test=test-1;
    end
    % ex=[0,1,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
    IP0=reshape(IP',1,64);                  %將IP變換表換成陣列IP0
    DB_IP=ex(IP0);
    
    L=DB_IP(1:32);                          %將明文區分成左區塊和右區塊
    R=DB_IP(33:64);
    c=[];
    for i=1:16
        
        E0=reshape(E',1,48);
        R_E=R(E0);
        if m==1
            R_K=double(xor(R_E,Ki(i,:)));
        else
            R_K=double(xor(R_E,Ki(17-i,:)));
        end
        
        %S1盒
        Box=R_K(1:6);
        a=Box(1)*2+Box(6)+1;
        b=Box(2)*8+Box(3)*4+Box(4)*2+Box(5)+1;
        s1=two(S1(a,b),3);
        %S2盒
        Box=R_K(7:12);
        a=Box(1)*2+Box(6)+1;
        b=Box(2)*8+Box(3)*4+Box(4)*2+Box(5)+1;
        s2=two(S2(a,b),3);
        %S3盒
        Box=R_K(13:18);
        a=Box(1)*2+Box(6)+1;
        b=Box(2)*8+Box(3)*4+Box(4)*2+Box(5)+1;
        s3=two(S3(a,b),3);
        %S4盒
        Box=R_K(19:24);
        a=Box(1)*2+Box(6)+1;
        b=Box(2)*8+Box(3)*4+Box(4)*2+Box(5)+1;
        s4=two(S4(a,b),3);
        %S5盒
        Box=R_K(25:30);
        a=Box(1)*2+Box(6)+1;
        b=Box(2)*8+Box(3)*4+Box(4)*2+Box(5)+1;
        s5=two(S5(a,b),3);
        %S6盒
        Box=R_K(31:36);
        a=Box(1)*2+Box(6)+1;
        b=Box(2)*8+Box(3)*4+Box(4)*2+Box(5)+1;
        s6=two(S6(a,b),3);
        %S7盒
        Box=R_K(37:42);
        a=Box(1)*2+Box(6)+1;
        b=Box(2)*8+Box(3)*4+Box(4)*2+Box(5)+1;
        s7=two(S7(a,b),3);
        %S8盒
        Box=R_K(43:48);
        a=Box(1)*2+Box(6)+1;
        b=Box(2)*8+Box(3)*4+Box(4)*2+Box(5)+1;
        s8=two(S8(a,b),3);
        c=[s1,s2,s3,s4,s5,s6,s7,s8];
        R_P=c(P);
        temp=L;
        L=R;
        R=double(xor(temp,R_P));
    end
    change=[R,L];
    IP_10=reshape(IP_1',1,64);
    change=change(IP_10);
    answer=[answer,change];
end
CS=[];
answer=num2str(answer);
pos= answer~=' ';
answer=answer(pos);
aws=answer;

if m==1
fid=fopen('toencrypt.txt','w');
fprintf(fid,'%s\n',answer);
fclose('all');
for i=1:4:length(answer)-3
    Ci=answer(i:i+3);
    CS=[CS,num2str(dec2hex(bin2dec(Ci)))];
    aws=CS;
end
else
 for i=1:8:length(answer)-7
     Ci=answer(i:i+7);
     CS=[CS,char(bin2dec(num2str(Ci)))];
 end
  aws=CS;
%   disp(aws)
end
end

function toTwo=two(text,kind)
if kind==1
    twoi=['00000000',dec2bin(text)];
    twoi=twoi(end-7:end);
    twoi=[str2num(twoi(1)),str2num(twoi(2)),str2num(twoi(3)),str2num(twoi(4)),str2num(twoi(5)),str2num(twoi(6)),str2num(twoi(7)),str2num(twoi(8))];
    toTwo=twoi;
elseif kind==2
    twoi=['0000',dec2bin(hex2dec(text))];
    twoi=twoi(end-3:end);
    twoi=[str2num(twoi(1)),str2num(twoi(2)),str2num(twoi(3)),str2num(twoi(4))];
    toTwo=twoi;
elseif kind==3
    twoi=['0000',dec2bin(text)];
    twoi=twoi(end-3:end);
    twoi=[str2num(twoi(1)),str2num(twoi(2)),str2num(twoi(3)),str2num(twoi(4))];
    toTwo=twoi;
end
end

